avr-rust/avrd/packs/atmega/AT90PWM316.atdf
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1" mask="0x8F">
          <bitfield caption="ADC High Speed Mode" mask="0x80" name="ADHSM"/>
          <bitfield caption="ADC Auto Trigger Source Selection 3" mask="0x08" name="ADTS3"/>
          <bitfield caption="ADC Auto Trigger Source Selection 2" mask="0x04" name="ADTS2"/>
          <bitfield caption="ADC Auto Trigger Source Selection 1" mask="0x02" name="ADTS1"/>
          <bitfield caption="ADC Auto Trigger Source Selection 0" mask="0x01" name="ADTS0"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x7E" size="1">
          <bitfield caption="" mask="0x80" name="ADC7D"/>
          <bitfield caption="" mask="0x40" name="ADC6D"/>
          <bitfield caption="" mask="0x20" name="ADC5D"/>
          <bitfield caption="" mask="0x10" name="ADC4D"/>
          <bitfield caption="" mask="0x08" name="ADC3D"/>
          <bitfield caption="" mask="0x04" name="ADC2D"/>
          <bitfield caption="" mask="0x02" name="ADC1D"/>
          <bitfield caption="" mask="0x01" name="ADC0D"/>
        </register>
        <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x7F" size="1">
          <bitfield caption="" mask="0x20" name="ACMP0D"/>
          <bitfield caption="" mask="0x10" name="AMP0PD"/>
          <bitfield caption="" mask="0x08" name="AMP0ND"/>
          <bitfield caption="" mask="0x04" name="ADC10D"/>
          <bitfield caption="" mask="0x02" name="ADC9D"/>
          <bitfield caption="" mask="0x01" name="ADC8D"/>
        </register>
        <register caption="" name="AMP0CSR" offset="0x76" size="1">
          <bitfield caption="" mask="0x80" name="AMP0EN"/>
          <bitfield caption="" mask="0x40" name="AMP0IS"/>
          <bitfield caption="" mask="0x30" name="AMP0G"/>
          <bitfield caption="" mask="0x03" name="AMP0TS"/>
        </register>
        <register caption="" name="AMP1CSR" offset="0x77" size="1">
          <bitfield caption="" mask="0x80" name="AMP1EN"/>
          <bitfield caption="" mask="0x40" name="AMP1IS"/>
          <bitfield caption="" mask="0x30" name="AMP1G"/>
          <bitfield caption="" mask="0x03" name="AMP1TS"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_ADC_V_REF2">
        <value caption="AREF, Internal Vref turned off" name="VAL_0x00" value="0x00"/>
        <value caption="AVCC with external capacitor at AREF pin" name="VAL_0x01" value="0x01"/>
        <value caption="Reserved" name="VAL_0x02" value="0x02"/>
        <value caption="Internal 2.56V Voltage Reference with external capacitor at AREF pin" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="USART" name="USART">
      <register-group caption="USART" name="USART">
        <register caption="USART I/O Data Register" name="UDR" offset="0xC6" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="USART Control and Status register A" name="UCSRA" offset="0xC0" size="1" ocd-rw="R">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC"/>
          <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE"/>
          <bitfield caption="Data Overrun" mask="0x08" name="DOR"/>
          <bitfield caption="USART Parity Error" mask="0x04" name="UPE"/>
          <bitfield caption="Double USART Transmission Bit" mask="0x02" name="U2X"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM"/>
        </register>
        <register caption="USART Control an Status register B" name="UCSRB" offset="0xC1" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE"/>
          <bitfield caption="USART Data Register Empty Interrupt Enable" mask="0x20" name="UDRIE"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ2"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB8"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB8"/>
        </register>
        <register caption="USART Control an Status register C" name="UCSRC" offset="0xC2" size="1">
          <bitfield caption="USART Mode Select" mask="0x40" name="UMSEL0"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size Bits" mask="0x06" name="UCSZ"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL"/>
        </register>
        <register caption="USART Baud Rate Register High Byte" name="UBRRH" offset="0xC5" size="1">
          <bitfield caption="USART Baud Rate Register Bits" mask="0x0F" name="UBRR" lsb="8"/>
        </register>
        <register caption="USART Baud Rate Register Low Byte" name="UBRRL" offset="0xC4" size="1">
          <bitfield caption="USART Baud Rate Register bits" mask="0xFF" name="UBRR"/>
        </register>
      </register-group>
      <value-group caption="" name="COMM_UPM_PARITY_MODE">
        <value caption="Disabled" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
        <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="COMM_STOP_BIT_SEL">
        <value caption="1-bit" name="VAL_0x00" value="0x00"/>
        <value caption="2-bit" name="VAL_0x01" value="0x01"/>
      </value-group>
    </module>
