avr-rust/avrd/packs/atmega/AT90PWM316.atdf
    <module caption="Power Stage Controller" name="PSC">
      <register-group caption="Power Stage Controller" name="PSC0">
        <register caption="PSC 0 Input Capture Register " name="PICR0" offset="0xDE" size="2" mask="0x8FFF">
          <bitfield caption="PSC 0 Input Capture Software Trig" mask="0x8000" name="PCST0"/>
          <bitfield caption="PSC 0 Input Capture Bytes" mask="0x0FFF" name="PICR0"/>
        </register>
        <register caption="PSC 0 Input B Control" name="PFRC0B" offset="0xDD" size="1">
          <bitfield caption="PSC 0 Capture Enable Input Part B" mask="0x80" name="PCAE0B"/>
          <bitfield caption="PSC 0 Input Select for Part B" mask="0x40" name="PISEL0B"/>
          <bitfield caption="PSC 0 Edge Level Selector on Input Part B" mask="0x20" name="PELEV0B"/>
          <bitfield caption="PSC 0 Filter Enable on Input Part B" mask="0x10" name="PFLTE0B"/>
          <bitfield caption="PSC 0 Retrigger and Fault Mode for Part B" mask="0x0F" name="PRFM0B"/>
        </register>
        <register caption="PSC 0 Input A Control" name="PFRC0A" offset="0xDC" size="1">
          <bitfield caption="PSC 0 Capture Enable Input Part A" mask="0x80" name="PCAE0A"/>
          <bitfield caption="PSC 0 Input Select for Part A" mask="0x40" name="PISEL0A"/>
          <bitfield caption="PSC 0 Edge Level Selector on Input Part A" mask="0x20" name="PELEV0A"/>
          <bitfield caption="PSC 0 Filter Enable on Input Part A" mask="0x10" name="PFLTE0A"/>
          <bitfield caption="PSC 0 Retrigger and Fault Mode for Part A" mask="0x0F" name="PRFM0A"/>
        </register>
        <register caption="PSC 0 Control Register" name="PCTL0" offset="0xDB" size="1">
          <bitfield caption="PSC 0 Prescaler Selects" mask="0xC0" name="PPRE0"/>
          <bitfield caption="PSC 0 Balance Flank Width Modulation" mask="0x20" name="PBFM0"/>
          <bitfield caption="PSC 0 Asynchronous Output Control B" mask="0x10" name="PAOC0B"/>
          <bitfield caption="PSC 0 Asynchronous Output Control A" mask="0x08" name="PAOC0A"/>
          <bitfield caption="PSC0 Auto Run" mask="0x04" name="PARUN0"/>
          <bitfield caption="PSC0 Complete Cycle" mask="0x02" name="PCCYC0"/>
          <bitfield caption="PSC 0 Run" mask="0x01" name="PRUN0"/>
        </register>
        <register caption="PSC 0 Configuration Register" name="PCNF0" offset="0xDA" size="1">
          <bitfield caption="PSC 0 Fifty" mask="0x80" name="PFIFTY0"/>
          <bitfield caption="PSC 0 Autolock" mask="0x40" name="PALOCK0"/>
          <bitfield caption="PSC 0 Lock" mask="0x20" name="PLOCK0"/>
          <bitfield caption="PSC 0 Mode" mask="0x18" name="PMODE0"/>
          <bitfield caption="PSC 0 Output Polarity" mask="0x04" name="POP0"/>
          <bitfield caption="PSC 0 Input Clock Select" mask="0x02" name="PCLKSEL0"/>
        </register>
        <register caption="Output Compare RB Register " name="OCR0RB" offset="0xD8" size="2" mask="0xFFFF"/>
        <register caption="Output Compare SB Register " name="OCR0SB" offset="0xD6" size="2" mask="0x0FFF"/>
        <register caption="Output Compare RA Register " name="OCR0RA" offset="0xD4" size="2" mask="0x0FFF"/>
        <register caption="Output Compare SA Register " name="OCR0SA" offset="0xD2" size="2" mask="0x0FFF"/>
        <register caption="PSC0 Synchro and Output Configuration" name="PSOC0" offset="0xD0" size="1">
          <bitfield caption="Synchronization Out for ADC Selection" mask="0x30" name="PSYNC0"/>
          <bitfield caption="PSCOUT01 Output Enable" mask="0x04" name="POEN0B"/>
          <bitfield caption="PSCOUT00 Output Enable" mask="0x01" name="POEN0A"/>
        </register>
        <register caption="PSC0 Interrupt Mask Register" name="PIM0" offset="0xA1" size="1">
          <bitfield caption="PSC 0 Synchro Error Interrupt Enable" mask="0x20" name="PSEIE0"/>
          <bitfield caption="External Event B Interrupt Enable" mask="0x10" name="PEVE0B"/>
          <bitfield caption="External Event A Interrupt Enable" mask="0x08" name="PEVE0A"/>
          <bitfield caption="End of Cycle Interrupt Enable" mask="0x01" name="PEOPE0"/>
        </register>
        <register caption="PSC0 Interrupt Flag Register" name="PIFR0" offset="0xA0" size="1">
          <bitfield caption="PSC 0 Output A Activity" mask="0x80" name="POAC0B"/>
          <bitfield caption="PSC 0 Output A Activity" mask="0x40" name="POAC0A"/>
          <bitfield caption="PSC 0 Synchro Error Interrupt" mask="0x20" name="PSEI0"/>
          <bitfield caption="External Event B Interrupt" mask="0x10" name="PEV0B"/>
          <bitfield caption="External Event A Interrupt" mask="0x08" name="PEV0A"/>
          <bitfield caption="Ramp Number" mask="0x06" name="PRN0"/>
          <bitfield caption="End of PSC0 Interrupt" mask="0x01" name="PEOP0"/>
        </register>
      </register-group>
      <register-group caption="Power Stage Controller" name="PSC1">
        <register caption="PSC 1 Input Capture Register " name="PICR1" offset="0xEE" size="2" mask="0x8FFF">
          <bitfield caption="PSC 1 Input Capture Software Trig" mask="0x8000" name="PCST1"/>
          <bitfield caption="PSC 1 Input Capture Bytes" mask="0x0FFF" name="PICR1"/>
        </register>
        <register caption="PSC 1 Input B Control" name="PFRC1B" offset="0xED" size="1">
          <bitfield caption="PSC 1 Capture Enable Input Part B" mask="0x80" name="PCAE1B"/>
          <bitfield caption="PSC 1 Input Select for Part B" mask="0x40" name="PISEL1B"/>
          <bitfield caption="PSC 1 Edge Level Selector on Input Part B" mask="0x20" name="PELEV1B"/>
          <bitfield caption="PSC 1 Filter Enable on Input Part B" mask="0x10" name="PFLTE1B"/>
          <bitfield caption="PSC 1 Retrigger and Fault Mode for Part B" mask="0x0F" name="PRFM1B"/>
        </register>
        <register caption="PSC 1 Input B Control" name="PFRC1A" offset="0xEC" size="1">
          <bitfield caption="PSC 1 Capture Enable Input Part A" mask="0x80" name="PCAE1A"/>
          <bitfield caption="PSC 1 Input Select for Part A" mask="0x40" name="PISEL1A"/>
          <bitfield caption="PSC 1 Edge Level Selector on Input Part A" mask="0x20" name="PELEV1A"/>
          <bitfield caption="PSC 1 Filter Enable on Input Part A" mask="0x10" name="PFLTE1A"/>
          <bitfield caption="PSC 1 Retrigger and Fault Mode for Part A" mask="0x0F" name="PRFM1A"/>
        </register>
