avr-rust/avrd/packs/atmega/AT90PWM316.atdf
        <register caption="PSC 1 Control Register" name="PCTL1" offset="0xEB" size="1">
          <bitfield caption="PSC 1 Prescaler Selects" mask="0xC0" name="PPRE1"/>
          <bitfield caption="Balance Flank Width Modulation" mask="0x20" name="PBFM1"/>
          <bitfield caption="PSC 1 Asynchronous Output Control B" mask="0x10" name="PAOC1B"/>
          <bitfield caption="PSC 1 Asynchronous Output Control A" mask="0x08" name="PAOC1A"/>
          <bitfield caption="PSC1 Auto Run" mask="0x04" name="PARUN1"/>
          <bitfield caption="PSC1 Complete Cycle" mask="0x02" name="PCCYC1"/>
          <bitfield caption="PSC 1 Run" mask="0x01" name="PRUN1"/>
        </register>
        <register caption="PSC 1 Configuration Register" name="PCNF1" offset="0xEA" size="1">
          <bitfield caption="PSC 1 Fifty" mask="0x80" name="PFIFTY1"/>
          <bitfield caption="PSC 1 Autolock" mask="0x40" name="PALOCK1"/>
          <bitfield caption="PSC 1 Lock" mask="0x20" name="PLOCK1"/>
          <bitfield caption="PSC 1 Mode" mask="0x18" name="PMODE1"/>
          <bitfield caption="PSC 1 Output Polarity" mask="0x04" name="POP1"/>
          <bitfield caption="PSC 1 Input Clock Select" mask="0x02" name="PCLKSEL1"/>
        </register>
        <register caption="Output Compare RB Register " name="OCR1RB" offset="0xE8" size="2" mask="0xFFFF"/>
        <register caption="Output Compare SB Register " name="OCR1SB" offset="0xE6" size="2" mask="0x0FFF"/>
        <register caption="Output Compare RA Register " name="OCR1RA" offset="0xE4" size="2" mask="0x0FFF"/>
        <register caption="Output Compare SA Register " name="OCR1SA" offset="0xE2" size="2" mask="0x0FFF"/>
        <register caption="PSC1 Synchro and Output Configuration" name="PSOC1" offset="0xE0" size="1">
          <bitfield caption="Synchronization Out for ADC Selection" mask="0x30" name="PSYNC1_"/>
          <bitfield caption="PSCOUT11 Output Enable" mask="0x04" name="POEN1B"/>
          <bitfield caption="PSCOUT10 Output Enable" mask="0x01" name="POEN1A"/>
        </register>
        <register caption="PSC1 Interrupt Mask Register" name="PIM1" offset="0xA3" size="1">
          <bitfield caption="PSC 1 Synchro Error Interrupt Enable" mask="0x20" name="PSEIE1"/>
          <bitfield caption="External Event B Interrupt Enable" mask="0x10" name="PEVE1B"/>
          <bitfield caption="External Event A Interrupt Enable" mask="0x08" name="PEVE1A"/>
          <bitfield caption="End of Cycle Interrupt Enable" mask="0x01" name="PEOPE1"/>
        </register>
        <register caption="PSC1 Interrupt Flag Register" name="PIFR1" offset="0xA2" size="1">
          <bitfield caption="PSC 1 Output B Activity" mask="0x80" name="POAC1B"/>
          <bitfield caption="PSC 1 Output A Activity" mask="0x40" name="POAC1A"/>
          <bitfield caption="PSC 1 Synchro Error Interrupt" mask="0x20" name="PSEI1"/>
          <bitfield caption="External Event B Interrupt" mask="0x10" name="PEV1B"/>
          <bitfield caption="External Event A Interrupt" mask="0x08" name="PEV1A"/>
          <bitfield caption="Ramp Number" mask="0x06" name="PRN1"/>
          <bitfield caption="End of PSC1 Interrupt" mask="0x01" name="PEOP1"/>
        </register>
      </register-group>
      <register-group caption="Power Stage Controller" name="PSC2">
        <register caption="PSC 2 Input Capture Register " name="PICR2" offset="0xFE" size="2" mask="0x8FFF">
          <bitfield caption="PSC 2 Input Capture Software Trig" mask="0x8000" name="PCST2"/>
          <bitfield caption="PSC 2 Input Capture Bytes" mask="0x0FFF" name="PICR2"/>
        </register>
        <register caption="PSC 2 Input B Control" name="PFRC2B" offset="0xFD" size="1">
          <bitfield caption="PSC 2 Capture Enable Input Part B" mask="0x80" name="PCAE2B"/>
          <bitfield caption="PSC 2 Input Select for Part B" mask="0x40" name="PISEL2B"/>
          <bitfield caption="PSC 2 Edge Level Selector on Input Part B" mask="0x20" name="PELEV2B"/>
          <bitfield caption="PSC 2 Filter Enable on Input Part B" mask="0x10" name="PFLTE2B"/>
          <bitfield caption="PSC 2 Retrigger and Fault Mode for Part B" mask="0x0F" name="PRFM2B"/>
        </register>
        <register caption="PSC 2 Input B Control" name="PFRC2A" offset="0xFC" size="1">
          <bitfield caption="PSC 2 Capture Enable Input Part A" mask="0x80" name="PCAE2A"/>
          <bitfield caption="PSC 2 Input Select for Part A" mask="0x40" name="PISEL2A"/>
          <bitfield caption="PSC 2 Edge Level Selector on Input Part A" mask="0x20" name="PELEV2A"/>
          <bitfield caption="PSC 2 Filter Enable on Input Part A" mask="0x10" name="PFLTE2A"/>
          <bitfield caption="PSC 2 Retrigger and Fault Mode for Part A" mask="0x0F" name="PRFM2A"/>
        </register>
        <register caption="PSC 2 Control Register" name="PCTL2" offset="0xFB" size="1">
          <bitfield caption="PSC 2 Prescaler Selects" mask="0xC0" name="PPRE2"/>
          <bitfield caption="Balance Flank Width Modulation" mask="0x20" name="PBFM2"/>
          <bitfield caption="PSC 2 Asynchronous Output Control B" mask="0x10" name="PAOC2B"/>
          <bitfield caption="PSC 2 Asynchronous Output Control A" mask="0x08" name="PAOC2A"/>
          <bitfield caption="PSC2 Auto Run" mask="0x04" name="PARUN2"/>
          <bitfield caption="PSC2 Complete Cycle" mask="0x02" name="PCCYC2"/>
          <bitfield caption="PSC 2 Run" mask="0x01" name="PRUN2"/>
        </register>
        <register caption="PSC 2 Configuration Register" name="PCNF2" offset="0xFA" size="1">
          <bitfield caption="PSC 2 Fifty" mask="0x80" name="PFIFTY2"/>
          <bitfield caption="PSC 2 Autolock" mask="0x40" name="PALOCK2"/>
          <bitfield caption="PSC 2 Lock" mask="0x20" name="PLOCK2"/>
          <bitfield caption="PSC 2 Mode" mask="0x18" name="PMODE2"/>
          <bitfield caption="PSC 2 Output Polarity" mask="0x04" name="POP2"/>
          <bitfield caption="PSC 2 Input Clock Select" mask="0x02" name="PCLKSEL2"/>
          <bitfield caption="PSC 2 Output Matrix Enable" mask="0x01" name="POME2"/>
        </register>
