avr-rust/avrd/packs/atmega/AT90PWM316.atdf
        <register caption="Output Compare RB Register " name="OCR2RB" offset="0xF8" size="2" mask="0xFFFF"/>
        <register caption="Output Compare SB Register " name="OCR2SB" offset="0xF6" size="2" mask="0x0FFF"/>
        <register caption="Output Compare RA Register " name="OCR2RA" offset="0xF4" size="2" mask="0x0FFF"/>
        <register caption="Output Compare SA Register " name="OCR2SA" offset="0xF2" size="2" mask="0x0FFF"/>
        <register caption="PSC 2 Output Matrix" name="POM2" offset="0xF1" size="1">
          <bitfield caption="Output Matrix Output B Ramps" mask="0xF0" name="POMV2B"/>
          <bitfield caption="Output Matrix Output A Ramps" mask="0x0F" name="POMV2A"/>
        </register>
        <register caption="PSC2 Synchro and Output Configuration" name="PSOC2" offset="0xF0" size="1">
          <bitfield caption="PSC 2 Output 23 Select" mask="0xC0" name="POS2" lsb="2"/>
          <bitfield caption="Synchronization Out for ADC Selection" mask="0x30" name="PSYNC2_"/>
          <bitfield caption="PSCOUT23 Output Enable" mask="0x08" name="POEN2D"/>
          <bitfield caption="PSCOUT21 Output Enable" mask="0x04" name="POEN2B"/>
          <bitfield caption="PSCOUT22 Output Enable" mask="0x02" name="POEN2C"/>
          <bitfield caption="PSCOUT20 Output Enable" mask="0x01" name="POEN2A"/>
        </register>
        <register caption="PSC2 Interrupt Mask Register" name="PIM2" offset="0xA5" size="1">
          <bitfield caption="PSC 2 Synchro Error Interrupt Enable" mask="0x20" name="PSEIE2"/>
          <bitfield caption="External Event B Interrupt Enable" mask="0x10" name="PEVE2B"/>
          <bitfield caption="External Event A Interrupt Enable" mask="0x08" name="PEVE2A"/>
          <bitfield caption="End of Cycle Interrupt Enable" mask="0x01" name="PEOPE2"/>
        </register>
        <register caption="PSC2 Interrupt Flag Register" name="PIFR2" offset="0xA4" size="1">
          <bitfield caption="PSC 2 Output A Activity" mask="0x80" name="POAC2B"/>
          <bitfield caption="PSC 2 Output A Activity" mask="0x40" name="POAC2A"/>
          <bitfield caption="PSC 2 Synchro Error Interrupt" mask="0x20" name="PSEI2"/>
          <bitfield caption="External Event B Interrupt" mask="0x10" name="PEV2B"/>
          <bitfield caption="External Event A Interrupt" mask="0x08" name="PEV2A"/>
          <bitfield caption="Ramp Number" mask="0x06" name="PRN2"/>
          <bitfield caption="End of PSC2 Interrupt" mask="0x01" name="PEOP2"/>
        </register>
      </register-group>
    </module>
  </modules>
</avr-tools-device-file>
